#+TITLE: Draenor Project Notes
#+AUTHOR: Colin
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/colin/code/org-theme.css"/>

*** Results

/File sizes:/

- Uku: 128kb
- Vancouver: 6.2mb
- Ireland: 133.4mb
- Planet: 35gb

| Optimizations        | Nodes (ms) | Ways (ms) | Relations (ms) | Vancouver (ms) | Ireland (s) | Planet (mins) |
|----------------------+------------+-----------+----------------+----------------+-------------+---------------|
| None                 |      68.43 |      4.36 |           4.25 |       3394.128 |   73.028496 |     327.00416 |
| +Lazy Attoparsec+      |       67.8 |      4.56 |           4.25 |        3362.88 |    72.35616 |      323.9936 |
| +Streaming Decompress+ |      70.12 |       4.5 |           4.41 |       3477.952 |   74.832064 |     335.08011 |
| -O2                  |      59.63 |       4.2 |            3.9 |       2957.648 |   63.637136 |     284.95189 |
| Ignore ~HeaderBlock~   |       58.3 |      4.08 |           3.75 |        2891.68 |    62.21776 |     278.59627 |
| Use ~INLINE~           |       57.5 |      3.79 |           3.59 |          2852. |      61.364 |     274.77333 |
| Strict ~many1~         |      46.61 |      3.75 |           3.54 |       2311.856 |   49.742192 |     222.73365 |
| Strict ~Map~           |      46.35 |      3.77 |           3.56 |        2298.96 |    49.46472 |      221.4912 |
| +Strict State+         |      52.46 |      3.79 |           3.67 |       2602.016 |   55.985312 |     250.68885 |
| +StrictData Ext.+      |      68.55 |     28.66 |           27.8 |        3400.08 |    73.15656 |      327.5776 |
| Use ~scanl~            |      31.79 |      3.82 |           3.63 |       1576.784 |   33.926288 |     151.91381 |
| ~Int~ everywhere       |       25.8 |      3.55 |           3.52 |        1279.68 |    27.53376 |      123.2896 |
| *TARGET*               |        6.5 |           |                |          322.4 |      6.9368 |     31.061333 |
#+TBLFM: $5=$2 * 49.6::$6=($2 * 1067.2) / 1000::$7=($2 * 286720) / 60000

